# SUMMARY

1. It seems that the query with SQLite does not have the row_number() function. I'm going to test the postgresql query on sql fiddle instead. A place where I can test postgresql code. 


---

In [2]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [10]:
df = pd.read_csv('../datasets/csv/sql_codility_qn3_II.csv')
df = df.iloc[:9,:4]
df

     sender recipient        date  amount
0     Smith  Williams  2000-01-01     200
1     Smith    Taylor  2002-09-27    1024
2     Smith   Johnson  2005-06-26     512
3  Williams   Johnson  2010-12-17     100
4  Williams   Johnson  2004-03-22      10
5     Brown   Johnson  2013-03-20     500
6   Johnson  Williams  2007-06-02     400
7   Johnson  Williams  2005-06-26     400
8   Johnson  Williams  2005-06-26     200

In [11]:
# yes, this creates a file in my local drive.
db_connection = sqlite3.connect('../datasets/sql/property_guru_test.db.sqlite')

In [12]:
# this code just wrote the pandas df into sql form
df.to_sql(name = 'PG', con = db_connection, if_exists = 'replace', index = False)

Test query :

In [14]:
query = '''
SELECT "sender" 
FROM PG -- do you remember the name you gave this file? PG. Refer to the cell above.
'''

sql.read_sql(query, con = db_connection).head() # this connection is where my file is.

     sender
0     Smith
1     Smith
2     Smith
3  Williams
4  Williams

Ok, now I got this sql querying thing going. Start learning the query :
[The link to the stackoverflow answer for this ](https://stackoverflow.com/questions/42608988/how-to-get-summation-with-count-larger-than-certain-amount)

---

The answer : but executing this answer does not work. Will have to study it :

query = '''select recipient as account_name
from (
  select * 
    , row_number() over (
        partition by recipient
        order by amount desc
        ) as rn
  from transfers
  ) as i
where rn < 4
group by recipient
having sum(amount)>=1024 '''

In [17]:
query = '''
SELECT *
FROM PG -- do you remember the name you gave this file? PG. Refer to the cell above.
'''

sql.read_sql(query, con = db_connection).head() # this connection is where my file is.

     sender recipient        date  amount
0     Smith  Williams  2000-01-01     200
1     Smith    Taylor  2002-09-27    1024
2     Smith   Johnson  2005-06-26     512
3  Williams   Johnson  2010-12-17     100
4  Williams   Johnson  2004-03-22      10

What does PARTITION BY do in sql? :

1. A GROUP BY normally reduces the number of rows returning by aggregating the values of the rows. A PARTITION BY on the other hand does not affect the number of rows returned.

What is the ROW NUMBER () window function?

QUOTE: The Row_Number function is used to provide consecutive numbering of the rows in the result by the order selected in the OVER clause for each partition specified in the OVER clause. It will assign the value 1 for the first row and increase the number of the subsequent rows.

STATE:
1. To provide numbering of the rows.
2. The order of this numbering is done through the OVER clause.
3. This numbering is done to each partition specified in the OVER clause.

SUMMARY:
1. It is a numbering function.
2. The numbering is done through the OVER clause.
3. There can be partitions in the OVER clause.

Syntax : 

ROW_NUMBER ( )  OVER ( [PARTITION BY value_exp, ... [ n ] ] order_by_clause)

QUOTE : The ROW_NUMBER function enumerates the rows in the sort order defined in the over clause.

---

__ROW_NUMBER() Function without Partition By clause :__

Partition by clause is a optional part of Row_Number function and if you don't use it all the records of the result-set will be considered as a part of single record group or a single partition and then ranking functions are applied.

In [ ]:
SELECT *, ROW_NUMBER() OVER(ORDER BY EmpName) AS Row_Number  
FROM Employee

<img src='output_row_number().png' height="800" width="600">

__ROW_NUMBER() Function with Partition By clause__

QUOTE: When you specify a column or set of columns with PARTITION BY clause then it will divide the result set into record partitions and then finally ranking functions are applied to each record partition separately and the rank will restart from 1 for each record partition separately.

Summary:
1. It's a grouping. A partition is a group. Each group will be enumerated on its own.
2. The partition is detected similar in a GROUP BY way where each row may have a category like apple, orange or banana. This column can be called fruits. I can PARTITION BY "fruits" and all rows corresponding to apple will be partition 1, other rows corresponding to orange will be partition 2, and the remaining rows that correspond to banana will be partition 3. 
3. These partitions will be enumerated starting from 1 according to an order specified by the ORDER BY clause, where you can order it according to another column.
4. PARTIION BY "fruits" ORDER BY "price" ASC (this means apple, oranges, and banana rows will be orderd from price lowest to highest and another column will be created that enumerates this organization).
5. The entire ROW_NUMBER () clause is like this :
>ROW_NUMBER ( ) OVER ( PARTITION BY "fruits" ORDER BY "price" ASC ) AS "row_number"
6. CONCLUSION:
    * (1) Remember that ROW NUMBER ( ) initiates this function 
    * (2) OVER states the behavior of the enumeration, what is the main organization that is numbering should take place? what category am I interested in? 
    * (3) And according to which number valued column do I want to order this organization and ASC or DESC? 
    * (4) give a number to this new column that enumerates this organization that you need.

__testing the ROW_NUMBER () functin on my table__

In [ ]:
SELECT *, ROW_NUMBER() OVER(Partition by EmpName ORDER BY EmpName) AS Row_Number from Employee

query = '''
SELECT *, ROW_NUMBER() OVER(Partition by "sender" ORDER BY "amount") AS Row_number
FROM PG
'''

sql.read_sql(query, con = db_connection).head()
# remember the comma in the SELECT sentence area indicates the selection or creation of another column

In [21]:
query = '''
SELECT *
FROM PG
'''

sql.read_sql(query, con = db_connection).head()
# remember the comma in the SELECT sentence area indicates the selection or creation of another column

     sender recipient        date  amount
0     Smith  Williams  2000-01-01     200
1     Smith    Taylor  2002-09-27    1024
2     Smith   Johnson  2005-06-26     512
3  Williams   Johnson  2010-12-17     100
4  Williams   Johnson  2004-03-22      10

# TO BE CONTINUED 
https://stackoverflow.com/questions/16847574/how-to-use-row-number-in-sqlite

Damn it. This Row function might not work in SQL lite.

1. Figure out how to and where else can I test this row function.
2. How is postgre and sql lite different. 
3. Are there other databases where this row_function() not work? hmmm. 

Shouldn't all sql querying be the same?